ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_setPromotionalSaleListings_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
	<soapenv:Header>
		<ebl:RequesterCredentials>
			<ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
		</ebl:RequesterCredentials>
	</soapenv:Header>
	<soapenv:Body>
		<ebl:SetPromotionalSaleListingsRequest>
			<ebl:Version>%s(version)</ebl:Version>
			<ebl:Action>INVALID</ebl:Action>
			<ebl:PromotionalSaleID>%s(promotionalSaleId)</ebl:PromotionalSaleID>
			<ebl:PromotionalSaleItemIDArray xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
				<ebl:ItemID>%s(itemIdMandatory)</ebl:ItemID>
			</ebl:PromotionalSaleItemIDArray>
		</ebl:SetPromotionalSaleListingsRequest>
	</soapenv:Body>
</soapenv:Envelope>